about_bot_text = """
ℹ️ **О боте Qyzmeta** ℹ️
**Qyzmeta** - это бот для Telegram, который позволяет пользователям легко создавать и управлять заявками. Он предназначен для упрощения процесса оформления заявок на сервисное обслуживание и другие услуги.
**Основные функции:**
- **Создание заявок**: Пользователи могут создавать новые заявки, указывая название, описание и цену.
- **Управление заявками**: Пользователи могут изменять и закрывать свои заявки, а также просматривать все доступные заявки.
- **Просмотр заявок**: Все пользователи могут просматривать доступные заявки.
**Преимущества использования Qyzmeta:**
- **Удобство**: Легкий и интуитивно понятный интерфейс для создания и управления заявками.
- **Оперативность**: Пользователи смогут быстро найти нужные заявки и связаться с исполнителями.
- **Поддержка**: Быстрая и эффективная поддержка пользователей через бота @qyzmetasup.
**Как начать:**
1. Если еще не зарегистрированы, перезапустите бота и нажмите кнопку "Старт".
2. Отправьте свой номер телефона для подтверждения.
3. После регистрации вы сможете создавать и управлять своими заявками.
**Контакты:**
Если у вас есть вопросы или предложения по улучшению бота, вы можете связаться с поддержкой через @qyzmetasup.

version = "0.1.0 -development"
"""
