privacy_policy_text = """
##### Политика конфиденциальности #####
1. Мы уважаем вашу конфиденциальность и обязуемся защищать ваши персональные данные. Эта политика конфиденциальности объясняет, как мы собираем, используем и защищаем вашу информацию.
2. Сбор информации
Мы собираем информацию, которую вы предоставляете нам при использовании нашего бота, включая ваш номер телефона и любые другие данные, которые вы решите предоставить.
3. Использование информации
Мы используем собранную информацию для предоставления вам услуг, улучшения качества нашего сервиса и связи с вами по вопросам, связанным с вашим использованием бота.
4. Защита информации
Мы принимаем разумные меры для защиты вашей информации от несанкционированного доступа, использования или раскрытия. Однако, пожалуйста, имейте в виду, что ни один метод передачи данных через Интернет или метод электронного хранения не является на 100% безопасным.
5. Раскрытие информации
Мы не будем продавать, обменивать или передавать вашу личную информацию третьим лицам без вашего согласия, за исключением случаев, когда это требуется по закону или для защиты наших прав.
6. Изменения в политике конфиденциальности
Мы оставляем за собой право в любое время изменять эту политику конфиденциальности. Мы уведомим вас о любых изменениях, опубликовав новую версию политики на нашем сайте, телеграм-канале или в боте.
7. Согласие
Используя нашего бота, вы соглашаетесь с условиями этой политики конфиденциальности. Если вы не согласны с этими условиями, пожалуйста, не используйте нашего бота.
8. Контактная информация
Если у вас есть вопросы или предложения по поводу нашей политики конфиденциальности, пожалуйста, свяжитесь с нами через бота @qyzmetasup
"""
